
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.ОстаткиТоваров.Записывать = Истина;
    Движения.ОстаткиТоваров.Очистить();
    
    ТЗ = СписокТоваровНаРеализацию.Выгрузить(, "Товар,Количество");
    ТЗ.Свернуть("Товар", "Количество");
    
    Для Каждого СтрокаТЗ Из ТЗ Цикл
        Движение = Движения.ОстаткиТоваров.Добавить();
        Движение.ВидДвижения = ВидДвиженияНакопления.Расход; // <--- РАСХОД
        Движение.Период = Дата;
        Движение.Товар = СтрокаТЗ.Товар;
        Движение.Склад = Склад;
        Движение.Количество = СтрокаТЗ.Количество;
    КонецЦикла;
    
КонецПроцедуры
