#Область ОбработчикиСобытий

&НаКлиенте
Процедура СписокТоваровНаРеализациюЦенаНаРеализациюПриИзменении(Элемент)
	ПересчитатьСтроку();
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровНаРеализациюКоличествоПриИзменении(Элемент)
	ПересчитатьСтроку();
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровНаРеализациюПослеУдаления(Элемент)
	Объект.СуммаДокумента = Объект.СписокТоваровНаРеализацию.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровНаРеализациюПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если Копирование Тогда
		Объект.СуммаДокумента = Объект.СписокТоваровНаРеализацию.Итог("Сумма");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедуры

&НаКлиенте
Процедура ПересчитатьСтроку()
	ТекущаяСтрока = Элементы.СписокТоваровНаРеализацию.ТекущиеДанные;
	ТекущаяСтрока.Сумма = ТекущаяСтрока.ЦенаНаРеализацию * ТекущаяСтрока.Количество;
	Объект.СуммаДокумента = Объект.СписокТоваровНаРеализацию.Итог("Сумма");
КонецПроцедуры

#КонецОбласти