&НаКлиенте
Процедура ПересчитатьСтроку(Элемент)

	ТекущаяСтрока = Элементы.СписокТоваровНаРеализацию.ТекущиеДанные;
	ТекущаяСтрока.Сумма = ТекущаяСтрока.ЦенаНаРеализацию * ТекущаяСтрока.Количество;
	Объект.СуммаДокумента = Объект.СписокТоваровНаРеализацию.Итог("Сумма");

КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровНаРеализациюЦенаНаРеализациюПриИзменении(Элемент)

	ПересчитатьСтроку(Элемент);

КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровНаРеализациюКоличествоПриИзменении(Элемент)

	ПересчитатьСтроку(Элемент);

КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровНаРеализациюПослеУдаления(Элемент)

	Объект.СуммаДокумента = Объект.СписокТоваровНаРеализацию.Итог("Сумма");

КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровНаРеализациюПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	Если Копирование Тогда
		Объект.СуммаДокумента = Объект.СписокТоваровНаРеализацию.Итог("Сумма");
	КонецЕсли;

КонецПроцедуры
