 Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	 // 1. Очищаем старые движения (если документ перепроводится)
	 Движения.ОстаткиТоваров.Записывать = Истина;
	 Движения.ОстаткиТоваров.Очистить();
	 
	 // 2. Выгружаем табличную часть и сворачиваем по товарам
	 ТабличныеЗначения = СписокТоваров.Выгрузить(, "Товар,Количество");       
	 ТабличныеЗначения.Свернуть("Товар", "Количество");
	 
	 // 3. Проходим по свернутой таблице и создаем движения
	 Для Каждого СтрокаТЗ Из ТабличныеЗначения Цикл      
		 
		 Движение = Движения.ОстаткиТоваров.Добавить();
		 Движение.ВидДвижения = ВидДвиженияНакопления.Приход; // <--- ПРИХОД
		 Движение.Период = Дата; // Дата документа
		 Движение.Товар = СтрокаТЗ.Товар;
		 Движение.Склад = Склад;
		 Движение.Количество = СтрокаТЗ.Количество;       
		 
	 КонецЦикла;
 КонецПроцедуры
 
 Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	 // Проверяем, чтобы количество было строго больше нуля
	 Для Каждого СтрокаТовары Из СписокТоваров Цикл
		 
		 // Проверяем только заполненные строки, 
		 Если СтрокаТовары.Товар <> Неопределено И НЕ СтрокаТовары.Товар.Пустая() Тогда
			 
			 Если СтрокаТовары.Количество <= 0 Тогда
				 Сообщить("В строке №" + СтрокаТовары.НомерСтроки + " количество должно быть больше нуля!");
				 Отказ = Истина;
			 КонецЕсли;
			 
		 КонецЕсли;
		 
	 КонецЦикла; 
 КонецПроцедуры
