#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Для Каждого ТекущаяСтрокаТоваров Из СписокТоваров Цикл

		Если НЕ ЗначениеЗаполнено(ТекущаяСтрокаТоваров.Товар) Тогда
			Продолжить;
		КонецЕсли;

		Если ТекущаяСтрокаТоваров.Количество <= 0 Тогда
			Сообщить("В строке №" + ТекущаяСтрокаТоваров.НомерСтроки + " количество должно быть больше нуля!");
			Отказ = Истина;
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Движения.ОстаткиТоваров.Записывать = Истина;
	Движения.ОстаткиТоваров.Очистить(); // При перепроведении удаляем старые движения

	ТаблицаТоваровДляОприходования = СписокТоваров.Выгрузить(, "Товар,Количество");
	ТаблицаТоваровДляОприходования.Свернуть("Товар", "Количество");

	Для Каждого ТекущаяСтрокаТоваров Из ТаблицаТоваровДляОприходования Цикл

		Если НЕ ЗначениеЗаполнено(ТекущаяСтрокаТоваров.Товар) Тогда
			Продолжить;
		КонецЕсли;

		НовоеДвижение = Движения.ОстаткиТоваров.Добавить();
		НовоеДвижение.ВидДвижения = ВидДвиженияНакопления.Приход;
		НовоеДвижение.Период = Дата;
		НовоеДвижение.Товар = ТекущаяСтрокаТоваров.Товар;
		НовоеДвижение.Склад = Склад;
		НовоеДвижение.Количество = ТекущаяСтрокаТоваров.Количество;

	КонецЦикла;

КонецПроцедуры

#КонецОбласти