#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Для Каждого ТекущаяСтрокаТоваров Из СписокТоваров Цикл
		
		Если НЕ ЗначениеЗаполнено(ТекущаяСтрокаТоваров.Товар) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТекущаяСтрокаТоваров.Количество <= 0 Тогда
			Сообщить("В строке №" + ТекущаяСтрокаТоваров.НомерСтроки + " количество должно быть больше нуля!");
			Отказ = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ОстаткиТоваров.Записывать = Истина;
	Движения.ОстаткиТоваров.Очистить(); // При перепроведении удаляем старые движения 
	
	Движения.ОборотыТоваров.Записывать = Истина;
	Движения.ОборотыТоваров.Очистить();
	
	ТаблицаТоваровДляОприходования = СписокТоваров.Выгрузить(, "Товар,Количество,Цена");
	 	
	Для Каждого ТекущаяСтрокаТоваров Из ТаблицаТоваровДляОприходования Цикл
		
		Если НЕ ЗначениеЗаполнено(ТекущаяСтрокаТоваров.Товар) Тогда
			Продолжить;
		КонецЕсли;
		// 1. Запись в регистр Остатков
		НовоеДвижение = Движения.ОстаткиТоваров.Добавить();
		НовоеДвижение.ВидДвижения = ВидДвиженияНакопления.Приход;
		НовоеДвижение.Период = Дата;
		НовоеДвижение.Товар = ТекущаяСтрокаТоваров.Товар;
		НовоеДвижение.Склад = Склад;
		НовоеДвижение.Количество = ТекущаяСтрокаТоваров.Количество; 
		
		// 2. Запись в регистр Оборотов
		ДвижениеОборот = Движения.ОборотыТоваров.Добавить();
		ДвижениеОборот.Период = Дата;
		ДвижениеОборот.Товар = ТекущаяСтрокаТоваров.Товар;
		ДвижениеОборот.Склад = Склад;
		ДвижениеОборот.КоличествоПриход = ТекущаяСтрокаТоваров.Количество;
		ДвижениеОборот.Сумма = ТекущаяСтрокаТоваров.Количество * ТекущаяСтрокаТоваров.Цена;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти