 Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	// 1. Очищаем старые движения (если документ перепроводится)
    Движения.ОстаткиТоваров.Записывать = Истина;
    Движения.ОстаткиТоваров.Очистить();
    
    // 2. Выгружаем табличную часть и сворачиваем по товарам
    ТЗ = СписокТоваров.Выгрузить(, "Товар,Количество");       
    ТЗ.Свернуть("Товар", "Количество");
    
    // 3. Проходим по свернутой таблице и создаем движения
	Для Каждого СтрокаТЗ Из ТЗ Цикл      
		
        Движение = Движения.ОстаткиТоваров.Добавить();
        Движение.ВидДвижения = ВидДвиженияНакопления.Приход; // <--- ПРИХОД
        Движение.Период = Дата; // Дата документа
        Движение.Товар = СтрокаТЗ.Товар;
        Движение.Склад = Склад;
        Движение.Количество = СтрокаТЗ.Количество;       
		
    КонецЦикла;КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
     Для Каждого СтрокаТЧ Из СписокТоваров Цикл
        Если СтрокаТЧ.Товар = Справочники.Товары.ПустаяСсылка() Тогда
            Сообщить("В табличной части есть пустая строка! Удалите её перед проведением.");
            Отказ = Истина; // Запрещаем запись/проведение
            Прервать; // Дальше можно не проверять
        КонецЕсли;
    КонецЦикла;
 КонецПроцедуры
