 	&НаКлиенте
Процедура ПересчитатьСтроку(Элемент)
    ТекДанные = Элементы.СписокТоваров.ТекущиеДанные;
    ТекДанные.Сумма = ТекДанные.Цена * ТекДанные.Количество;
    Объект.СуммаДокумента = Объект.СписокТоваров.Итог("Сумма");
	КонецПроцедуры 
	
	&НаКлиенте
Процедура СписокТоваровЦенаПриИзменении(Элемент) 
 ПересчитатьСтроку(Элемент);	
КонецПроцедуры



&НаКлиенте
Процедура СписокТоваровКоличествоПриИзменении(Элемент)   
 ПересчитатьСтроку(Элемент);	
КонецПроцедуры

 &НаКлиенте
Процедура СписокТоваровПослеУдаления(Элемент)
Объект.СуммаДокумента = Объект.СписокТоваров.Итог("Сумма")
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если Копирование 
		Тогда
    	Объект.СуммаДокумента = Объект.СписокТоваров.Итог("Сумма"); 
	КонецЕсли;
КонецПроцедуры


