#Область ОбработчикиСобытий

&НаКлиенте
Процедура СписокТоваровЦенаПриИзменении(Элемент)
	ПересчитатьСтроку();
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровКоличествоПриИзменении(Элемент)
	ПересчитатьСтроку();
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровПослеУдаления(Элемент)
	Объект.СуммаДокумента = Объект.СписокТоваров.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если Копирование Тогда
		Объект.СуммаДокумента = Объект.СписокТоваров.Итог("Сумма");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедуры

&НаКлиенте
Процедура ПересчитатьСтроку()
	ТекущаяСтрокаТоваров = Элементы.СписокТоваров.ТекущиеДанные;

	Если ТекущаяСтрокаТоваров <> Неопределено Тогда

		// Защищаемся от пустых значений!
		Если ТекущаяСтрокаТоваров.Цена = Неопределено Тогда
			ТекущаяСтрокаТоваров.Цена = 0;
		КонецЕсли;

		Если ТекущаяСтрокаТоваров.Количество = Неопределено Тогда
			ТекущаяСтрокаТоваров.Количество = 0;
		КонецЕсли;

		ТекущаяСтрокаТоваров.Сумма = ТекущаяСтрокаТоваров.Цена * ТекущаяСтрокаТоваров.Количество;
		Объект.СуммаДокумента = Объект.СписокТоваров.Итог("Сумма");

	КонецЕсли;
КонецПроцедуры

#КонецОбласти