#Область ОбработчикиСобытий

&НаКлиенте
Процедура СписокТоваровЦенаПриИзменении(Элемент)
	ПересчитатьСтроку();
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровКоличествоПриИзменении(Элемент)
	ПересчитатьСтроку();
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровПослеУдаления(Элемент)
	Объект.СуммаДокумента = Объект.СписокТоваров.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если Копирование Тогда
		Объект.СуммаДокумента = Объект.СписокТоваров.Итог("Сумма");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедуры

&НаКлиенте
Процедура ПересчитатьСтроку()
	ТекущаяСтрока = Элементы.СписокТоваров.ТекущиеДанные;
	ТекущаяСтрока.Сумма = ТекущаяСтрока.Цена * ТекущаяСтрока.Количество;
	Объект.СуммаДокумента = Объект.СписокТоваров.Итог("Сумма");
КонецПроцедуры

#КонецОбласти