#Область ОбработчикиСобытий

&НаКлиенте
Процедура СписокТоваровЦенаПриИзменении(Элемент)
	// Передаем: ЭтотОбъект (форма), "СписокТоваров", "Цена", "Сумма"
	ОбщийМодульКлиент.ПересчитатьСуммуСтроки(ЭтотОбъект, "СписокТоваров", "Цена", "Сумма");
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровКоличествоПриИзменении(Элемент)
	// Передаем: ЭтотОбъект (форма), "СписокТоваров", "Цена", "Сумма"
	ОбщийМодульКлиент.ПересчитатьСуммуСтроки(ЭтотОбъект, "СписокТоваров", "Цена", "Сумма");
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровПослеУдаления(Элемент)
	Объект.СуммаДокумента = Объект.СписокТоваров.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если Копирование Тогда
		Объект.СуммаДокумента = Объект.СписокТоваров.Итог("Сумма");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедуры

#КонецОбласти