#Область ОбработчикиСобытий

&НаКлиенте
Процедура СписокТоваровЦенаПриИзменении(Элемент)
	ПересчитатьСтроку();
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровКоличествоПриИзменении(Элемент)
	ПересчитатьСтроку();
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровПослеУдаления(Элемент)
	Объект.СуммаДокумента = Объект.СписокТоваров.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если Копирование Тогда
		Объект.СуммаДокумента = Объект.СписокТоваров.Итог("Сумма");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедуры

&НаКлиенте
Процедура ПересчитатьСтроку()
	ТекущаяСтрока = Элементы.СписокТоваров.ТекущиеДанные;

	Если ТекущаяСтрока <> Неопределено Тогда

		// Обязательно защищаемся от пустых значений!
		Если ТекущаяСтрока.Цена = Неопределено Тогда
			ТекущаяСтрока.Цена = 0;
		КонецЕсли;

		Если ТекущаяСтрока.Количество = Неопределено Тогда
			ТекущаяСтрока.Количество = 0;
		КонецЕсли;

		ТекущаяСтрока.Сумма = ТекущаяСтрока.Цена * ТекущаяСтрока.Количество;
		Объект.СуммаДокумента = Объект.СписокТоваров.Итог("Сумма");

	КонецЕсли;
КонецПроцедуры

#КонецОбласти